In [1]:
import pandas as pd
import numpy as np

In [2]:
age = np.random.randint(10,100,15)

In [3]:
age

array([82, 13, 81, 86, 21, 14, 35, 27, 80, 12, 64, 11, 40, 52, 89])

In [4]:
s = pd.Series(age)

In [6]:
s.head()

0    82
1    13
2    81
3    86
4    21
dtype: int32

In [7]:
s.tail()

10    64
11    11
12    40
13    52
14    89
dtype: int32

In [8]:
s[0]

82

In [9]:
s[0:5]

0    82
1    13
2    81
3    86
4    21
dtype: int32

In [15]:
data = {
    "scores" : np.random.randint(20,120,8),
    "names" : np.array(['Sachin','Dhoni','Kohli','Yuvraj','Raina','Rohit','Rishabh','Jadeja']),
    "catches" : np.random.randint(1,6,8),
    "average" : np.random.randint(40,55,8)
}

In [16]:
data

{'scores': array([ 23,  27,  71, 108,  87,  92, 116,  59]),
 'names': array(['Sachin', 'Dhoni', 'Kohli', 'Yuvraj', 'Raina', 'Rohit', 'Rishabh',
        'Jadeja'], dtype='<U7'),
 'catches': array([2, 4, 2, 3, 5, 4, 2, 3]),
 'average': array([54, 48, 49, 43, 48, 48, 54, 48])}

In [17]:
df = pd.DataFrame(data)

In [18]:
df

   scores    names  catches  average
0      23   Sachin        2       54
1      27    Dhoni        4       48
2      71    Kohli        2       49
3     108   Yuvraj        3       43
4      87    Raina        5       48
5      92    Rohit        4       48
6     116  Rishabh        2       54
7      59   Jadeja        3       48

In [19]:
df.head()

   scores   names  catches  average
0      23  Sachin        2       54
1      27   Dhoni        4       48
2      71   Kohli        2       49
3     108  Yuvraj        3       43
4      87   Raina        5       48

In [21]:
df[df['catches'] >= 4]

   scores  names  catches  average
1      27  Dhoni        4       48
4      87  Raina        5       48
5      92  Rohit        4       48

In [22]:
df[df['catches'] >= 4][['names','average']]

   names  average
1  Dhoni       48
4  Raina       48
5  Rohit       48